In [1]:
import pandas as pd
from sqlalchemy import create_engine
from config import DB_USERNAME, DB_PASSWORD

In [4]:
engine = create_engine(f"postgresql://{DB_USERNAME}:{DB_PASSWORD}@localhost:5432/credit_card")

In [2]:
df = pd.read_csv("cleaned_credit_card.csv")
df.head()

        ID     0    1    2    3    4    5    X    C
0  5120092  61.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1  5120176  61.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
2  5002165  61.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
3  5143259  60.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0
4  5003330  60.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

In [3]:
df.shape

(45985, 9)

In [5]:
df.to_sql('credit_card', engine)

In [6]:
app_record_df = pd.read_csv("app_record_ml.csv")
app_record_df.head()

,Unnamed: 0,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,...,OCCUPATION_TYPE_Laborers,OCCUPATION_TYPE_Low-skill Laborers,OCCUPATION_TYPE_Managers,OCCUPATION_TYPE_Medicine staff,OCCUPATION_TYPE_Private service staff,OCCUPATION_TYPE_Realty agents,OCCUPATION_TYPE_Sales staff,OCCUPATION_TYPE_Secretaries,OCCUPATION_TYPE_Security staff,OCCUPATION_TYPE_Waiters/barmen staff
0,0,5008804,0,427500.0,-12005,-4542,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,5008805,0,427500.0,-12005,-4542,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2,5008806,0,112500.0,-21474,-1134,1,0,0,0,...,0,0,0,0,0,0,0,0,1,0
3,3,5008808,0,270000.0,-19110,-3051,1,0,1,1,...,0,0,0,0,0,0,1,0,0,0
4,4,5008809,0,270000.0,-19110,-3051,1,0,1,1,...,0,0,0,0,0,0,1,0,0,0

In [6]:
app_record_df = pd.read_csv("app_record_ml.csv")
app_record_df.head()

,Unnamed: 0,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,...,OCCUPATION_TYPE_Laborers,OCCUPATION_TYPE_Low-skill Laborers,OCCUPATION_TYPE_Managers,OCCUPATION_TYPE_Medicine staff,OCCUPATION_TYPE_Private service staff,OCCUPATION_TYPE_Realty agents,OCCUPATION_TYPE_Sales staff,OCCUPATION_TYPE_Secretaries,OCCUPATION_TYPE_Security staff,OCCUPATION_TYPE_Waiters/barmen staff
0,0,5008804,0,427500.0,-12005,-4542,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,5008805,0,427500.0,-12005,-4542,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2,5008806,0,112500.0,-21474,-1134,1,0,0,0,...,0,0,0,0,0,0,0,0,1,0
3,3,5008808,0,270000.0,-19110,-3051,1,0,1,1,...,0,0,0,0,0,0,1,0,0,0
4,4,5008809,0,270000.0,-19110,-3051,1,0,1,1,...,0,0,0,0,0,0,1,0,0,0

In [7]:
app_record_df.shape

(438557, 56)

In [8]:
app_record_df.to_sql('app_record', engine)